Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: As discussed, watermarks can be used to balance result completeness and result latency.
zh_cn: 我们在之前介绍过，水位线可用来平衡结果的完整性和延迟。

source: As explained in “Com‐ ponents of a Flink Setup” on page 38, a Flink application is submitted to the JobMan‐ ager (master), which distributes execution tasks to one or more TaskManagers (workers).
zh_cn: 正如之前第38页"搭建Flink所需组件"中介绍的，Flink应用会提交至JobManager（master），后者负责将需要执行的任务分配给一个或多个TaskManager（worker）。

source: As for the tuples, we filter the DataStream by age:
zh_cn: 和使用元组的情况一样，我们对DataStream按照年龄进行过滤：

source: As indicated by name, these functions are applicable in
zh_cn: 从名字就能看出，这些函数适用于不同的上下文环境。

source: As mentioned earlier, GenericWriteAheadSink cannot provide bulletproof exactly- once guarantees.
zh_cn: 如前所述，GenericWriteAheadSink无法百分之百提供精确一次保障。

source: As mentioned, an application can only be started from a savepoint if it is compatible with the savepoint.
zh_cn: 我们在前文提到过，应用只有和保存点兼容时才可以从该保存点启动。

source: As motivated in Chapter 2, a certain degree of timestamp out-of-orderness is given in basically all real-world use cases.
zh_cn: 正如第2章所述，基本上所有现实世界的应用场景都会出现一定程度的时间戳乱序。

source: As of version 0.10.0, Kafka supports message timestamps.
zh_cn: Kafka从版本0.10.0开始支持消息时间戳。

source: As one could imagine, supporting stateful operators comes with a few implementa‐ tion challenges:
zh_cn: 不难想象，支持状态化算子将面临很多实现上的挑战：

source: As pointed out in “Event-Time Processing” and “Assigning Timestamps and Generating
zh_cn: 正如在"事件时间处理"及"分配时间戳和生成水位线"章节提到的，

source: As previously stated, stateful stream processing is a versatile and flexible design archi‐ tecture that can be used for many different use cases.
zh_cn: 综上所述，状态化流处理是一类用途广泛、灵活多变的设计模式，可用来解决很多不同的用例问题。

source: As previously stated, stateful streaming processing is a versatile and flexible design pattern and can be used to address many different use cases.
zh_cn: 如上所述，状态化流处理是一种用途广泛、灵活多变的设计模式，可用来解决很多不同的用例问题。

source: As seen in “Time Semantics”, a certain degree of timestamp out-of- orderness is given in basically all real-world use cases.
zh_cn: 正如"时间语义"一节所述，基本上所有现实应用场景都会出现一定程度的时间戳乱序。

source: As shown in Figure 1-8, you will see some statistics about the local Flink cluster you just started.
zh_cn: 如图1-8所示，你会看到一些有关刚刚启动的本地Flink集群的统计信息。

source: As shown in Figure 2-12, in Alice’s case, a processing-time window would continue counting time when her phone gets discon‐ nected, thus not accounting for her game activity during that time.
zh_cn: 如图2-12所示，在爱丽丝的例子中，处理时间窗口在她手机离线后会继续计时，因此不会把她在那段时间的活动考虑在内。

source: As shown in Figure 3-4, each of the four sender tasks needs at least four network buf‐ fers to send data to each of the receiver tasks and each receiver task requires at least four buffers to receive data.
zh_cn: 如图3-4所示，每个发送端任务至少需要4个网络缓冲区来向任一接收端任务发送数据。而同样，每个接收端任务也需要至少4个缓冲区来接收数据。

source: As soon as a task has received barriers from all its input partitions, it initiates a check‐ point at the state backend and broadcasts the checkpoint barrier to all of its down‐ stream connected tasks as shown in Figure 3-23.
zh_cn: 如图3-23所示，任务在收齐全部输入分区发送的分隔符后，就会通知状态后端开始生成检查点，同时把检查点分隔符广播到下游相连的任务。

source: As soon as enough slots become available, the JobMaster con‐ tainer deploys the application for execution.
zh_cn: 一旦有了足够多的处理槽，JobMaster容器就会部署并执行应用。

source: As soon as one parti‐ tion does not advance its watermarks or becomes completely idle and does not ship any records or watermarks, the event-time clock of a task will not advance and the timers of the task will not trigger.
zh_cn: 只要有一个分区的水位线没有前进，或分区完全空闲下来不再发送任何记录或水位线，任务的事件时间时钟就不会前进，继而导致计时器无法触发。

source: As the first event comes in, it will be immediately processed with the minimum latency possible.
zh_cn: 当第一个事件到来，系统会立刻以尽可能低的延迟进行处理。

source: As the key space evolves, the state of expired keys becomes stale and useless.
zh_cn: 随着键值空间的不断变化，状态中那些过期的键值会变得陈旧且失去价值。

source: As the name suggests, a dataflow program describes how data flows between opera‐ tions.
zh_cn: 顾名思义，dataflow程序描述了数据如何在操作之间流动。

source: As the name suggests, the window join is based on Flink’s windowing mechanism.
zh_cn: 顾名思义，基于窗口的Join需要用到Flink中的窗口机制。

source: As usual, BulkWriter.Factory is an interface that can be implemented for custom
zh_cn: BulkWriter.Factory自身同样也是一个接口，我们可以用它来自定义文件格式，例如Apache Orc。

source: As usual, result records are emitted by passing them to the Collector.
zh_cn: 照例，你可以在方法中将结果记录传递给Collector发送出去。

source: As with histograms, you can use DropWizard meters by adding the flink- metrics-dropwizard dependency in your pom.xml and wrapping the meter in a DropwizardMeterWrapper class.
zh_cn: 和直方图一样，你可以通过在pom.xml中添加flink-metrics-dropwizard依赖并将meter包在DropwizardMeterWrapper类中来使用DropWizard meter。

source: As you can see in Example 6-13, the ReduceFunction and ProcessWindowFunction are both defined in the reduce() method call.
zh_cn: 可以看到，示例6-13在调用reduce()方法时既用到了ReduceFunction也用到了ProcessWindowFunction。

source: As you can see in Example 8-8, we do not specify an INSERT query.
zh_cn: 从示例8-8可以看出，我们没有指定INSERT查询。

source: As you can see, the Trigger API can be used to implement sophisticated logic by pro‐ viding access to time and state.
zh_cn: 如你所见，Trigger API的时间和状态访问机制允许你用它来实现复杂逻辑。

source: As you can see, the implementation of the interface is not too involved.
zh_cn: 如你所见，TwoPhaseCommitSinkFunction实现起来并不复杂。

source: As you can see, these are the same parameters we used when deploying the job- specific image with docker-compose.
zh_cn: 不难看出，此处使用的参数和使用docker-compose部署针对特定作业的镜像相同。

source: As you learned in “Time Semantics”, Flink’s time- based operators can be applied with different notions of time.
zh_cn: 正如你在"时间语义"一节所看到的，Flink内部基于时间的算子可以在不同的时间概念下使用。

source: As you learned in “Timestamps” on page 47, time‐ stamps either exist in the data before entering the data processing pipeline, or are assigned by the application at the sources.
zh_cn: 正如在第47页"时间戳"一节所介绍的，时间戳在数据进入处理管道之前就已经存在其中，或者需要由应用在数据源处分配。

source: As you might expect, maintaining streaming applications is more challenging than maintaining batch applications.
zh_cn: 不难想象，维护流式应用要比维护批处理应用更具挑战。

source: As you might imagine, supporting stateful operators comes with a few implementa‐ tion challenges:
zh_cn: 不难想象，支持状态化算子将面临很多实现上的挑战：

source: As you saw in “Data Parallelism and Task Parallelism” on page 18, Flink splits data streams into partitions and processes each partition in parallel by a separate operator task.
zh_cn: 正如第18页"数据并行和任务并行"一节所述，Flink会将数据流划分为不同的分区，并将它们交由不同的算子任务来并行执行。

source: Assigner with periodic watermarks
zh_cn: 周期性水位线分配器

source: Assigner with punctuated watermarks
zh_cn: 定点水位线分配器

source: Assigning Timestamps and Generating Watermarks
zh_cn: 分配时间戳和生成水位线

source: Assigning timestamps and generating watermarks in a SourceFunction is discussed in “Source Functions, Timestamps, and Watermarks” on page 204.
zh_cn: 在SourceFunction中分配时间戳和生成水位线将在204页"数据源函数、时间戳和水位线"一节讨论，

source: Assigning unique identifiers to operators is mandatory for most application changes.
zh_cn: 大多数应用的改动都需要以分配算子唯一标识为前提。

source: Assigning watermarks periodically means that we instruct the system to emit water‐ marks and advance the event time in fixed intervals of machine time.
zh_cn: 周期性分配水位线的含义是我们会指示系统以固定的机器时间间隔来发出水位线并推动事件时间前进。

source: Assuming you are running a local Flink setup that exposes its REST API
zh_cn: 假设你所搭建和运行的本地Flink其REST API使用的端口是8081，

source: AsyncFunction concurrently sends multiple queries and processes their results asyn‐ chronously.
zh_cn: 该函数能够同时发出多个查询并对其结果进行异步处理。

source: AsyncFunction that queries a JDBC database
zh_cn: 利用JDBC查询数据库的AsyncFunction

source: Asynchronous checkpointing significantly reduces the time until a task continues to process data.
zh_cn: 异步生成检查点可以有效降低任务恢复数据处理所需等待的时间。

source: Asynchronously Accessing External Systems
zh_cn: 异步访问外部系统

source: Asynchronously Accessing External Systems | 217
zh_cn: 异步访问外部系统 | 217

source: At high load, this change will also increase through‐ put, because more customers will be served in the same amount of time.
zh_cn: 这样在高峰时段，相同时间内可以服务的顾客数量多了，吞吐量也自然会提高。

source: At high load, this change will also increase throughput, because more customers will be served in the same amount of time.
zh_cn: 这样在高峰时段，相同时间内可以服务的顾客数量多了，吞吐量自然也会提高。

source: At the book’s GitHub page, you will find one repository with Scala examples and one repository with Java exam‐ ples.
zh_cn: 在本书的GitHub页面上，你会看到两个分别包含Scala示例和Java示例的代码仓库。

source: At the same time, it is also one of the trickiest metrics to define in a distributed streaming engine with rich semantics such as Flink.
zh_cn: 而同时，它对于像Flink这样具有丰富语义的分布式流处理引擎而言，也是最难定义的指标之一。

source: At the same time, long-running applications need to be maintained.
zh_cn: 同时，我们也需要对长时间运行的应用进行一些维护，

source: At the same time, the result completeness might suffer because relevant records might not be included in the result and would be considered as late records.
zh_cn: 但同时结果的完整性可能会受影响，因为可能有部分相关记录被视为迟到记录，没能参与运算。

source: At the source: Timestamps and watermarks can be assigned and generated by a SourceFunction when a stream is ingested into an application.
zh_cn: 在数据源完成：我们可以利用SourceFunction在应用读入数据流的时候分配时间戳和生成水位线。

source: At this point the system has reached the peak throughput and further increasing the event rate will only result in worse latency.
zh_cn: 此时系统吞吐已到极限，一味提高事件到达速率只会让延迟更糟。

source: At this point, it should be clear that latency and throughput are not independent met‐ rics.
zh_cn: 至此你应该已经清楚，延迟和吞吐并非相互独立的指标。

source: At this point, it should be quite clear that latency and throughput are not independ‐ ent metrics.
zh_cn: 至此你应该很清楚，延迟和吞吐并非相互独立的指标。

source: At this point, the system has reached its peak throughput and further increasing the event rate will only result in worse latency.
zh_cn: 此时系统吞吐已到极限，一味提高事件到达速率只会让延迟更糟。

source: At this point, you might be wondering why we would even bother with processing time if event time solves all of our problems.
zh_cn: 此刻你可能会有些疑惑：既然事件时间能够解决所有问题，为何还要去操心处理时间？

source: At this point, you might be wondering: Since event time solves all of our problems, why even bother considering processing time?
zh_cn: 此刻你可能会有些疑惑：既然事件时间能够解决所有问题，为什么还去费劲地考虑处理时间呢？

source: At-Least-Once
zh_cn: 至少一次

source: At-Most-Once
zh_cn: 至多一次

source: At-least-once
zh_cn: 至少一次

source: At-least-once Idempotent sink At-most-once
zh_cn: 至少一次 幂等性数据汇 至多一次

source: At-least-once guarantees for the Kafka sink
zh_cn: Kafka数据汇的至少一次保障

source: At-most-once
zh_cn: 至多一次

source: At-most-once is the trivial case that guarantees processing of each event at most once.
zh_cn: 至多一次是一种最简单的情况，它保证每个事件至多被处理一次。

source: At-most-once is the trivial case that guarantees processing of each event at-most-once.
zh_cn: 至多一次也是最简单的情况，它保证每个事件至多被处理一次。

source: Available Variables
zh_cn: 可用变量

source: Available variables to configure the formatting of metrics scopes
zh_cn: 用于配置指标域格式的可用变量

source: Average values hide the true distribution of processing delays and might make it hard to detect problems.
zh_cn: 平均值会掩盖处理延迟的真实分布，从而导致难以发现问题。

source: Avro-generated classes are automatically identified by Flink and handled as POJOs.
zh_cn: Flink还会将Avro自动生成的类作为POJO处理。

source: Back-pressured tasks will display a HIGH sign; otherwise you should see a nice green OK message displayed.
zh_cn: 如果任务已经触发背压将显示一个HIGH标志，否则你会看到一个漂亮的绿色OK信息。

source: Backpressure metrics
zh_cn: 背压指标

source: Based on the key, the events of the stream are assigned to partitions, so that all
zh_cn: 根据键值，流中的事件会被分到不同的分区，

source: Based on the received watermarks, the operator computes a point in time up to which it expects to have received relevant input records.
zh_cn: 根据收到的水位线，算子会计算一个所有相关输入记录都已接收完毕的预期时间点。

source: Basic Transformations
zh_cn: 基本转换

source: Basic statistics such as the name of the application, the start time (and end time), and information about the executed tasks including the number of ingested and emitted records and bytes
zh_cn: 基本统计信息，例如：应用名称，开始时间（和结束时间），有关执行任务的信息（包括接收我发出的记录数和字节数）

source: Basic transformations are transformations on individual events.
zh_cn: 作用于单个事件的基本转换。

source: Basic transformations process individual events, meaning that each output record was produced from a single input record.
zh_cn: 基本转换会单独处理每个事件，这意味着每条输出记录都由单条输入记录所生成。

source: Batch applications can - in addition to pipelined communication - exchange data by collecting outgoing data at the sender.
zh_cn: 批处理应用除了流水线式通信，还可以在发送端收集全部需要发出的数据。

source: Batch applications can—in addition to pipelined communication—exchange data by collecting outgoing data at the sender.
zh_cn: 批处理应用除了流水线式通信之外，还可以在发送端收集需要发出的数据。

source: Batch jobs are internally represented as dataflow programs and run on the same underlying execution runtime as streaming jobs.
zh_cn: 在内部，批处理作业同样会表示为Dataflow程序并和流式作业共享底层运行环境。

source: Because efficient state access is crucial to processing records with low latency, each parallel task locally maintains its state to ensure fast state accesses.
zh_cn: 因此高效的状态访问对于记录处理的低延迟而言至关重要。为了保证快速访问状态，每个并行任务都会把状态维护在本地。

source: Because it writes data to disk and supports incremental checkpoints
zh_cn: 因为它能够将数据写入磁盘，且支持增量检查点（详见第58页"检查点、保存点及状态恢复"一节），

source: Because local state can be maintained and checkpointed in different ways, state backends are pluggable—two applications can use different state backend implementations to maintain their states.
zh_cn: 由于本地状态的维护及写入检查点的方式多种多样，所以状态后端被设计为可插拔的（pluggable）——两个应用可以选择不同的状态后端实现来维护其状态。

source: Because microservices are strictly decoupled from each other and only communicate over well defined inter‐ faces, each microservice can be implemented with a custom technology stack includ‐ ing programming language, libraries, and data stores.
zh_cn: 由于微服务彼此间严格解耦且仅通过定义良好的接口通信，因此每个微服务可以选用不同的技术栈，即编程语言、类库和数据存储等。

source: Because the choice of the timestamp is application-specific and the watermarks depend on the timestamps and characteris‐ tics of the stream, applications have to explicitly assign timestamps and generate watermarks.
zh_cn: 由于不同的应用会选择不同的时间戳，而水位线依赖于时间戳和数据流本身的特征，所以应用必须显式地分配时间戳和生成水位线。

source: Because the paths in the metadata file are absolute, moving a savepoint to a different path will render it unusable.
zh_cn: 由于元数据文件中存储的是绝对路径，所以将保存点移动到其他路径会使其失效。

source: Because this strategy replicates data and involves network communication, it is fairly expensive.
zh_cn: 该策略会把数据复制多份且涉及网络通信，因此代价十分昂贵。

source: Before a sink task emits its first record, it starts a transaction on the external sink system.
zh_cn: 数据汇任务在发出首个记录之前，会先在外部数据汇系统中开启一个事务。

source: Before adding a new component into the mix, a logical question to ask should be, “How well does it work with the other com‐ ponents in my stack?”
zh_cn: 在向其中添加新组件之前，我们一般都会先思考一个问题，"新加的组件和现有组件栈兼容情况如何？"

source: Before comparing the temperature measurements and updating the last temperature,
zh_cn: 在对温度值进行比较并更新最近一次温度之前，

source: Before diving into the details of how to set up Flink on Kubernetes, we need to briefly explain a few Kubernetes terms:
zh_cn: 但在深入了解部署详情之前，我们需要简要解释几个Kubernetes的常用术语：

source: Before execution, these are translated into physical dataflow graphs of connected parallel tasks, each running some operator logic, consuming input streams and producing output streams for other tasks.
zh_cn: 在实际执行前，它们需要被翻译成物理Dataflow图，其中会包含很多相连的并行任务。每个任务都要运行一部分算子逻辑，消费输入流并为其他任务生成输出流。

source: Before execution, these are translated into physical dataflow graphs of many connected parallel tasks, each running some operator logic, consuming input streams and producing output streams for other tasks.
zh_cn: 在执行之前，他们需要被翻译为连接很多并行任务的物理dataflow图。其中每个任务都要运行一部分算子逻辑，消费输入流并为其他任务生成输出流。

source: Before manually deleting a pending file, you need to check whether it is lingering or about to be committed.
zh_cn: 在手动删除它们之前，你需要检查文件是否是因为延迟所致或者马上将要提交。

source: Before the rise of modern stream processors, a common approach to process unbounded data was to repeatedly schedule jobs over small batches of incoming events on a batch processing system.
zh_cn: 在现代流处理引擎兴起之前，处理无限数据的通用办法是将到来事件分成小批次，然后不停地在批处理系统上调度并运行作业。

source: Before we delve into the fundamentals of stream processing, let’s look at the back‐ ground on dataflow programming and the terminology we will use throughout this book.
zh_cn: 在深入探索流处理的基础知识之前，我们需要先介绍Dataflow编程的必要背景，并建立起贯穿整书的术语体系。

source: Before we delve into the fundamentals of stream processing, we must first introduce the necessary background on dataflow programming and establish the terminology that we will use throughout this book.
zh_cn: 在深入研究流处理的基本知识之前，我们需要先介绍dataflow编程的必要背景，建立起贯穿整书的术语体系。

source: Before we describe the different types of guarantees, we need to clarify a few points that are often the source of confusion when discussing task failures in stream processors.
zh_cn: 在讨论不同类型的保障之前，我们需要澄清一些在讨论流处理引擎任务故障时容易导致困惑的点。

source: Before we describe the different types of guarantees, we need to clarify a few points that are often the source of confusion when discussing task failures in stream pro‐ cessors.
zh_cn: 在讨论不同类型的保障之前，我们需要澄清一些在讨论流处理引擎任务故障时容易导致困惑的点。

source: Before we discuss its use cases, we briefly explain how stateful stream process‐ ing works.
zh_cn: 在讨论这些用例之前，我们首先简要解释一下状态化流处理的工作原理。

source: Before we discuss its use cases, we briefly explain how stateful stream processing works.
zh_cn: 在讨论这些场景之前，我们首先简要解释一下状态化流处理的工作原理。

source: Besides ingesting or emitting data streams, enriching a data stream by looking up information in a remote database is another common use case that requires interact‐ ing with an external storage system.
zh_cn: 除了单纯的收发之外，我们还经常需要利用从远程数据库获取的信息来丰富数据流，此时也会涉及和外部存储系统的交互。

source: Besides removing the need for an additional operator, assigning timestamps and gen‐ erating watermarks in a source function can be beneficial if one parallel instance of a source function consumes records from multiple stream partitions, such as partitions of a Kafka topic.
zh_cn: 在数据源函数中分配时间戳和生成水位线除了免去一个额外的算子外，还会在单个数据源并行实例从多个数据流分区（例如Kafka某主题的多个分区）中消费数据时受益。

source: Besides resource considerations for the recovery, there are two other recovery-related topics we will discuss: restart strategies and local recovery.
zh_cn: 恢复过程除了资源因素，还有两个值得讨论的主题：重启策略和本地恢复。

source: Besides starting standby TaskManagers, a standalone deployment does not need addi‐ tional configuration to be able to recover from TaskManager failures.
zh_cn: 有了后备TaskManager，独立集群部署无需额外配置就可以从TaskManager故障中恢复。

source: Besides the much shorter time needed for an event to be incorporated into an analyt‐ ics result, there is another, less obvious, advantage of streaming analytics applications.
zh_cn: 除了将事件整合到分析结果的用时更短，流式分析应用还有另一个不太明显的优势。

source: Besides the much smaller time for an event to be incorporated into an analytics result, there is another, less obvious, advantage of streaming analytics applications.
zh_cn: 除了将事件整合到分析结果用时较短，流式分析应用还有另一个不太显眼的优势。

source: Besides watermarks, Flink has many features to tweak the exact behavior of time-based oper‐ ations, such as process functions and window triggers, and offers different ways to handle late data, which are discussed in “Handling Late Data” on page 148.
zh_cn: 除了水位线，Flink还有很多功能可用于调整时间相关相关操作（例如处理函数和窗口触发器）的具体行为。此外，它还提供了不同的方法来处理迟到数据，相关内容会在148页"处理迟到数据"一节进行讨论。

source: Beware of Clock Skew
zh_cn: 小心时钟偏差

source: Black squares are duplicated, and gray squares are filtered out.
zh_cn: 如果是黑色方块会将其复制；如果是灰色方块会将其过滤掉。

source: Blogs
zh_cn: 博客

source: Bob and Alice play the same game but have different mobile pro‐ viders.
zh_cn: 虽然玩的游戏相同，但鲍勃和爱丽丝的移动网络供应商不同。

source: Bob and Alice play the same game but they have different mobile providers.
zh_cn: 鲍勃和爱丽丝虽然玩的游戏相同，但他们的移动网络供应商不同。

source: Bootstrap a Flink Maven Project
zh_cn: 创建Flink Maven项目

source: Bootstrap a Flink Maven project
zh_cn: 启用Flink Maven项目

source: Both aspects are discussed in later sections of this chapter.
zh_cn: 我们同样会在本章稍后讨论它们。

source: Both connectors are fully self-contained and do not expose any dependencies.
zh_cn: 这两个连接器都可以独立工作，没有暴露任何对外的依赖。

source: Both context objects offer a method getBroad castState(MapStateDescriptor) that provides access to a broadcast state handle.
zh_cn: 虽然两个上下文对象都提供了getBroadcastState(MapStateDescriptor)方法来获得广播状态句柄，

source: Both functions are typed on the types of the first and second input stream and on the type of the output stream and define two methods—one for each input.
zh_cn: 两个函数都是以两条输入流的类型外加输出流的类型作为其类型参数，它们为两条输入流定义了各自的处理方法。

source: Both input streams are keyed on their key attributes and the common window assigner maps events of both streams to common windows, meaning a window stores
zh_cn: 两条的输入流都会根据各自的键值属性进行分区，公共窗口分配器会将二者的事件映射到公共窗口内（其中同时存储了两条流中数据）。

source: Both kinds of queries are executed by a data warehouse in a batch processing
zh_cn: 无论哪一类查询，都是在数据仓库中以批处理的方式执行，

source: Both kinds of queries are executed by a data warehouse in a batch processing fashion, as shown in Figure 1-3.
zh_cn: 如图1-3所示，无论哪一类查询，都是在数据仓库中以批处理的方式执行。

source: Both methods are called with an Iterable that serves all elements that were added to the window, the number
zh_cn: 它们的参数都是一个针对窗口内已有元素的Iterable对象、

source: Both methods are overloaded for different combinations of parameters.
zh_cn: 它们二者都提供了多个不同参数组合的重载方法。

source: Both template files contain placeholders that need to be replaced with actual values:
zh_cn: 两个模板文件都包含需要用实际值替换的占位符：

source: Both templates implement the CheckpointListener interface to receive notifications
zh_cn: 这两个模板都实现了CheckpointListener接口（有关该接口的详情，请参阅"接收检查点完成通知"一节），支持从JobManager接收有关检查点完成的通知：

source: Both were covered in Chapter 6.
zh_cn: 我们已经在第6章对它们进行了介绍。

source: Broadcast state
zh_cn: 广播状态（broadcast state）

source: Broadcast state can be combined with a regular DataStream or KeyedStream.
zh_cn: 它可以和常规的DataStream或KeyedStream结合使用。

source: Broadcast state is an improved version of the broadcast()- connect() transformation.
zh_cn: 广播状态是broadcast()-connect()转换的一个改进版本，

source: BroadcastProcessFunc tion does not expose a timer service to register timers and consequently does not offer an onTimer() method.
zh_cn: BroadcastProcessFunction没有提供用于注册计时器的时间服务，因此也就没有onTimer()方法。

source: BroadcastProcessFunction and KeyedBroadcastProcessFunction differ from a regular CoProcessFunction because the element processing methods are not sym‐ metric.
zh_cn: BroadcastProcessFunction和KeyedBroadcastProcessFunction与常规CoProcessFunction不同，它们针对两条流内元素的处理方法是非对称的。

source: BroadcastStream must be put as an argument in the connect() method.
zh_cn: BroadcastStream必须以参数形式传给connect()方法。

source: Broadcasted Events Might Not Arrive in Deterministic Order
zh_cn: 广播事件的到达顺序可能不确定

source: Buffering is a mandatory technique to fully utilize the bandwidth of network connections.
zh_cn: 若想充分利用网络连接带宽，缓冲是一项必要技术。

source: Buffering is needed to fully utilize the bandwidth of network connec‐ tions.
zh_cn: 若想充分利用网络连接带宽，就需要对数据进行缓冲。

source: Buffers that need to be sent to the other TaskManager are multiplexed over the same network connection.
zh_cn: 所有需要向对方TaskManager传输数据的缓冲区会复用同一个网络连接。

source: Buffers which need to be sent to the other Task‐ Manager are multiplexed over the same network connection.
zh_cn: 需要发往同一个TaskManager的缓冲区数据会复用同一个网络连接。

source: Bugs need to be fixed, functionality adjusted, added, or removed, or the parallelism of the operator needs to be adjusted to account for higher or lower data rates.
zh_cn: 例如：修复Bug，添加、删除或调整功能，或针对不同的数据到来速率调整算子的并行度。

source: Build Flink for a specific Hadoop version.
zh_cn: 针对特定版本的Hadoop构建Flink。

source: Building a job-specific Flink Docker image
zh_cn: 针对特定作业构建Flink Docker镜像

source: Building a so-called fat JAR file is the preferred way to handle application dependen‐ cies.
zh_cn: 我们推荐使用构建"胖JAR"的方式来处理应用依赖。

source: Built-in Window Assigners
zh_cn: 内置窗口分配器

source: Bulk-encoding formats can only be combined with the OnCheckpointRollingPolicy, which rolls in-progress part files on every checkpoint.
zh_cn: 批量编码格式只能与OnCheckpointRollingPolicy结合使用，后者会在每次生成检查点的时候生成新的分区文件。

source: Bundle all dependencies into the application JAR file.
zh_cn: 将所有依赖打进应用的JAR包。
